Autodesk.Revit.DB.EndCapCondition
Used by CompoundStructure to describe which shell layers participate in end wrapping.
Since:
2012

Autodesk.Revit.DB.EndCapCondition.NoEndCap
No end wrapping ability. Floors and roofs must use this enum value.

Autodesk.Revit.DB.EndCapCondition.Interior
Only the interior shell layers participate in end wrapping.

Autodesk.Revit.DB.EndCapCondition.Exterior
Only the exterior shell layers participate in end wrapping.

Autodesk.Revit.DB.EndCapCondition.None
None of the shell layers participate in end wrapping.